In [1]:
#IMPORT DATA FROM EXCEL INTO MYSQL

In [2]:
import sqlite3
import pandas as pd
from sqlalchemy import create_engine

In [3]:
pwd

'/Users/peiqinhe/Desktop/python-master'

In [4]:
df= pd.read_excel('Student_UCB.xlsx')
df

   Student ID First Name Last Name  Age      Major
0         100       Liby       Lee   22       Econ
1         101    Stanley      Chao   21    Finance
2         102       Jack       Zhu   20         CS
3         103       Kate        Ma   18        Bio
4         104      Nancy       Guo   19  Sociology
5         105      Jenny        Xu   23       Math
6         106      Scott       Lin   22         CS
7         107        Tom        Du   19    Finance

In [5]:
df1=df.set_index(['Student ID'])
df1

           First Name Last Name  Age      Major
Student ID
100              Liby       Lee   22       Econ
101           Stanley      Chao   21    Finance
102              Jack       Zhu   20         CS
103              Kate        Ma   18        Bio
104             Nancy       Guo   19  Sociology
105             Jenny        Xu   23       Math
106             Scott       Lin   22         CS
107               Tom        Du   19    Finance

In [6]:
from sqlalchemy import create_engine

In [7]:
engine = create_engine("mysql+mysqlconnector://root:UCBkate59455$@HpQ-MacBook-Air.local:3306/successcareer", echo=False)

In [8]:
df.to_sql(name='UCB_Student', con=engine, if_exists="replace")

In [9]:
engine.execute("show create table UCB_Student").first()[1]

'CREATE TABLE `UCB_Student` (\n  `index` bigint DEFAULT NULL,\n  `Student ID` bigint DEFAULT NULL,\n  `First Name` text,\n  `Last Name` text,\n  `Age` bigint DEFAULT NULL,\n  `Major` text,\n  KEY `ix_UCB_Student_index` (`index`)\n) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci'

In [10]:
print(engine.execute("show create table UCB_Student").first()[1])

CREATE TABLE `UCB_Student` (
  `index` bigint DEFAULT NULL,
  `Student ID` bigint DEFAULT NULL,
  `First Name` text,
  `Last Name` text,
  `Age` bigint DEFAULT NULL,
  `Major` text,
  KEY `ix_UCB_Student_index` (`index`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci

In [11]:
engine.execute("select count(1) from UCB_Student").first()

(8,)

In [12]:
engine.execute("select * from UCB_Student limit 5").fetchall()

[(0, 100, 'Liby', 'Lee', 22, 'Econ'),
 (1, 101, 'Stanley', 'Chao', 21, 'Finance'),
 (2, 102, 'Jack', 'Zhu', 20, 'CS'),
 (3, 103, 'Kate', 'Ma', 18, 'Bio'),
 (4, 104, 'Nancy', 'Guo', 19, 'Sociology')]

In [13]:
#Get SQL Table to DataFrame

In [14]:
pip install pypyodbc

Requirement already satisfied: pypyodbc in /Users/peiqinhe/opt/anaconda3/lib/python3.8/site-packages (1.3.2)
Requirement already satisfied: setuptools in /Users/peiqinhe/opt/anaconda3/lib/python3.8/site-packages (from pypyodbc) (52.0.0.post20210125)
Note: you may need to restart the kernel to use updated packages.

In [15]:
import sqlalchemy
import pypyodbc as odbc

In [16]:
engine = sqlalchemy.create_engine("mysql+mysqlconnector://root:UCBkate59455$@HpQ-MacBook-Air.local:3306/successcareer", echo=False)

In [17]:
df = pd.read_sql("student", engine)
df

   student_id    name      major  gpa
0           1    Jack        Bio  3.5
1           2    Kate  Sociology  3.8
2           3  Clarie        Bio  3.6